// ========================================================
//
// 立方体メッシュコンポーネントクラス[Component_CubeMesh.h]
// 
//									Date:20250520
//									Author:Yuuki Otokawa
// ========================================================

#pragma once

//==========================================================================
// ヘッダーインクルード
//==========================================================================

#include "Component_MeshFilter.h"

//==========================================================================
// クラス定義
//==========================================================================

class CubeMesh :
    public MeshFilter
{
private:
    // 頂点数
    static const auto NUM_CUBE_VERTEX = 24;
	// インデックス数
	static const auto NUM_CUBE_INDEX = 36;
public:
    /// @brief 立方体メッシュを生成するコンストラクタです。
    CubeMesh();

};

