// ========================================================
//
// プレーン平面用メッシュフィルタークラス[PlaneMesh.h]
// 
//									Date:20250528
//									Author:Yuuki Otokawa
// ========================================================

#pragma once

//==========================================================================
// ヘッダーインクルード
//==========================================================================

#include "Component_MeshFilter.h"

//==========================================================================
// クラス定義
//==========================================================================

class PlaneMesh :
    public MeshFilter
{
private:
	// 頂点数
	static const int NUM_PLANE_VERTEX = 4;
	// インデックス数
	static const int NUM_PLANE_INDEX = 4;

public:
	/// @brief プレーンメッシュを生成するコンストラクタです。
	PlaneMesh();
};

